package com.work.mr.config;

import java.util.Arrays;
import java.util.Map;
import java.util.stream.Collectors;

/**
 * Application constants.
 * 
 * 
 *
 * 
 * 
 * 
 * क का कि की कु कू के कै को कौ कं कः कॅ कॉ क्‌
ख खा खि खी खु खू खे खै खो खौ खं खः खॅ खॉ ख्‌
ग गा गि गी गु गू गे गै गो गौ गं गः गॅ गॉ ग्‌
घ घा घि घी घु घू घे घै घो घौ घं घः घॅ घॉ घ्‌
च चा चि ची चु चू चे चै चो चौ चं चः चॅ चॉ च्‌
छ छा छि छी छु छू छे छै छो छौ छं छः छॅ छॉ छ्‌
ज जा जि जी जु जू जे जै जो जौ जं जः जॅ जॉ ज्‌
झ झा झि झी झु झू झे झै झो झौ झं झः झॅ झॉ झ्‌
ट टा टि टी टु टू टे टै टो टौ टं टः टॅ टॉ ट्‌
ठ ठा ठि ठी ठु ठू ठे ठै ठो ठौ ठं ठः ठॅ ठॉ ठ्‌
ड डा डि डी डु डू डे डै डो डौ डं डः डॅ डॉ ड्‌
ढ ढा ढि ढी ढु ढू ढे ढै ढो ढौ ढं ढः ढॅ ढॉ ढ्‌
ण णा णि णी णु णू णे णै णो णौ णं णः णॅ णॉ ण्‌
त ता ति ती तु तू ते तै तो तौ तं तः तॅ तॉ त्‌
थ था थि थी थु थू थे थै थो थौ थं थः थॅ थॉ थ्‌
द दा दि दी दु दू दे दै दो दौ दं दः दॅ दॉ द्‌
ध धा धि धी धु धू धे धै धो धौ धं धः धॅ धॉ ध्‌
न ना नि नी नु नू ने नै नो नौ नं नः नॅ नॉ न्‌
प पा पि पी पु पू पे पै पो पौ पं पः पॅ पॉ प्‌
फ फा फि फी फु फू फे फै फो फौ फं फः फॅ फॉ फ्‌
ब बा बि बी बु बू बे बै बो बौ बं बः बॅ बॉ ब्‌
भ भा भि भी भु भू भे भै भो भौ भं भः भॅ भॉ भ्‌
म मा मि मी मु मू मे मै मो मौ मं मः मॅ मॉ म्‌
य या यि यी यु यू ये यै यो यौ यं यः यॅ यॉ य्‌
र रा रि री रु रू रे रै रो रौ रं रः रॅ रॉ र्‌
ल ला लि ली लु लू ले लै लो लौ लं लः लॅ लॉ ल्‌
व वा वि वी वु वू वे वै वो वौ वं वः वॅ वॉ व्‌
श शा शि शी शु शू शे शै शो शौ शं शः शॅ शॉ श्‌
ष षा षि षी षु षू षे षै षो षौ षं षः षॅ षॉ ष्‌
स सा सि सी सु सू से सै सो सौ सं सः सॅ सॉ स्‌
ह हा हि ही हु हू हे है हो हौ हं हः हॅ हॉ ह्‌
ळ ळा ळि ळी ळु ळू ळे ळै ळो ळौ ळं ळः ळॅ ळॉ ळ्‌
क्ष क्षा क्षि क्षी क्षु क्षू क्षे क्षै क्षो क्षौ क्षं क्षः क्षॅ क्षॉ क्ष्‌
ज्ञ ज्ञा ज्ञि ज्ञी ज्ञु ज्ञू ज्ञे ज्ञै ज्ञो ज्ञौ ज्ञं ज्ञः ज्ञॅ ज्ञॉ ज्ञ्‌
 */
public final class Constants {

    //Regex for acceptable logins
    public static final String LOGIN_REGEX = "^[_'.@A-Za-z0-9-]*$";

    public static final String SYSTEM_ACCOUNT = "system";
    
    public static final String BARAKHADI = "barakhadi";
    
    public static final String TXT_EXTN = ".txt";
    
    public static final String FILE_SEPERATOR = "/";
    
    public static final String[] aConsonants = {
    		"a", // अ
    		"k", // क       1
    		"kh",// ख      2
    		"g", // ग      3
    		"gh",// घ      4
 //   		"g1", // G ङ      5
    		
    		"ch", // च     6
    		"ch1", //Chछ     7
    		"j", // ज      8
    		"jh", // झ    9
    		"ny", // ञ    10
    		
    		"t1", // ट     11
    		"Th",// ठ    12
    		"D", // ड     13
    		"Dh",// ढ    14
    		"n1", // ण   15
    		
    		"t11", // त    16
    		"thh",// थ    17
    		"dd", // द    18
    		"dhh",// ध    19
    		"n", // न    20
    		
    		"p", // प    21
    		"ph",// फ   22
    		"b", // ब    23
    		"bh",// भ   24
    		"m", // म    25
    		
    		"y", // य     26
    		"r", // र     27
    		"l", // ल    28
    		"v", // व    29
    		"sh",// श    30
    		
    		"sh1", // ष    31
    		"s",  // स    32
    		"h",  // ह    33
    		"l1",  // ळ    34
    		"ksh",// क्ष    35
    	//	"dny" // ज्ञ    36
    		
    }; 


	

	
	
	
	
	

    
    public static final Map<String, String> consonantMap =
    	    Arrays.stream(new String[][] {
    	    	{ "a", "अ" },  // 0 
    	    	{ "k", "क" },  // 1 
    	        { "kh", "ख" }, // 2
    	        { "g", "ग" }, // 3
    	        { "gh", "घ" }, // 4
    	        { "g1", "ङ" }, // G 5

    	    	{ "ch", "च" }, // 6
    	        { "ch1", "छ" }, // 7
    	        { "j", "ज" }, // 8
    	        { "jh", "झ" }, // 9
    	        { "ny", "ञ" }, // 10
    	        

    	    	{ "t1", "ट" }, // T 11
    	        { "th", "ठ" }, // 12
    	        { "dh", "ड" }, // 13
    	        { "dh1", "ढ" }, // Dh 14
    	        { "n1", "ण" }, // 15

    	    	
    	    	{ "t11", "त" }, // 16
    	        { "thh", "थ" }, // 17
    	        { "dd", "द" }, // 18
    	        { "dhh", "ध" }, // 19
    	        { "n", "न" }, // 20

    	    	
    	    	{ "p", "प" }, // 21
    	        { "ph", "फ" }, // 22
    	        { "b", "ब" }, // 23
    	        { "bh", "भ" }, // 24
    	        { "m", "म" }, // 25
 

    	    	
    	    	{ "y", "य" }, // 26
    	        { "r", "र" }, // 27
    	        { "l", "ल" }, // 28
    	        { "v", "व" }, // 29
    	        { "sh", "श" }, // 30

    	    	
    	    	{ "sh1", "ष" }, // 31
    	        { "s", "स" }, // 32
    	        { "h", "ह" }, // 33
    	        { "l1", "ळ" }, // 34
    	        { "ksh", "क्ष" },// 35
    	  //      { "dny", "ज्ञ" },// 36
    	        
    	        
    	    }).collect(Collectors.toMap(kv -> kv[0], kv -> kv[1]));
    
    

    private Constants() {
    }
}
